jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/Cloud/aws_tests/Src/ports/aws_ota_pal.c
/*
 * Amazon FreeRTOS OTA PAL for STM32L4 V1.0.0
 * Copyright (C) 2018 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/*
  Platform abstraction layer for Amazon FreeRTOS OTA agent.
  This file contains the OTA support functions specific to the STM32L4xx target platform.

  TARGET_PLATFORM_STM32L4XX
*/
#include <stdio.h>
#include "flash.h"
#include "iot_crypto.h"
#include "aws_iot_ota_pal.h"
#include "aws_iot_ota_agent_internal.h"
#include "string.h"

#include "stm32l4xx_hal.h"      /* Flash programming of the FW*/
#include "se_def.h"
#include "sfu_fwimg_regions.h"
#ifdef ENABLE_IMAGE_STATE_HANDLING
#include "se_interface_application.h"
#endif /* ENABLE_IMAGE_STATE_HANDLING */

/**
  * @brief Specifies a structure containing values related to the management of multi-images in Flash.
  */
typedef struct
{
  uint32_t  MaxSizeInBytes;        /*!< The maximum allowed size for the FwImage in User Flash (in Bytes) */
  uint32_t  DownloadAddr;          /*!< The download address for the FwImage in UserFlash */
  uint32_t  ImageOffsetInBytes;    /*!< Image write starts at this offset */
  uint32_t  ExecutionAddr;         /*!< The execution address for the FwImage in UserFlash */
} SFU_FwImageFlashTypeDef;

#define USER_CONF_MAGIC            0x0123456789ABCDEFuLL
typedef struct {
  uint64_t magic;                  /*!< The USER_CONF_MAGIC magic word signals that the structure was once written to FLASH. */
  uint32_t ota_agent_state;
} iot_state_t;

#ifdef ENABLE_IMAGE_STATE_HANDLING
OTA_Err_t prvInitOTAImageState(void);
OTA_Err_t prvSetOTAImageState( OTA_ImageState_t eNewOTAState );
#else
static int setIoTDeviceState(iot_state_t *state);
static int getIoTDeviceState(const iot_state_t **state);
#endif /* ENABLE_IMAGE_STATE_HANDLING */

static uint32_t SFU_APP_InstallAtNextReset(uint32_t *fw_header);
static uint32_t SFU_APP_GetDownloadAreaInfo(SFU_FwImageFlashTypeDef *pArea);


/* Specify the OTA signature algorithm we support on this platform. */
const char cOTA_JSON_FileSignatureKey[ OTA_FILE_SIG_KEY_STR_MAX_LENGTH ] = "sig-sha256-ecdsa";


/* The static functions below (prvPAL_CheckFileSignature and prvPAL_ReadAndAssumeCertificate)
 * are optionally implemented. If these functions are implemented then please set the following macros in
 * aws_test_ota_config.h to 1:
 * otatestpalCHECK_FILE_SIGNATURE_SUPPORTED
 * otatestpalREAD_AND_ASSUME_CERTIFICATE_SUPPORTED
 */

/**
 * @brief Verify the signature of the specified file.
 *
 * This function should be implemented if signature verification is not offloaded
 * to non-volatile memory io functions.
 *
 * This function is called from prvPAL_Close().
 *
 * @param[in] C OTA file context information.
 *
 * @return Below are the valid return values for this function.
 * kOTA_Err_None if the signature verification passes.
 * kOTA_Err_SignatureCheckFailed if the signature verification fails.
 * kOTA_Err_BadSignerCert if the if the signature verification certificate cannot be read.
 *
 */
static OTA_Err_t prvPAL_CheckFileSignature( OTA_FileContext_t * const C );

/**
 * @brief Read the specified signer certificate from the filesystem into a local buffer.
 *
 * The allocated memory returned becomes the property of the caller who is responsible for freeing it.
 *
 * This function is called from prvPAL_CheckFileSignature(). It should be implemented if signature
 * verification is not offloaded to non-volatile memory io function.
 *
 * @param[in] pucCertName The file path of the certificate file.
 * @param[out] ulSignerCertSize The size of the certificate file read.
 *
 * @return A pointer to the signer certificate in the file system. NULL if the certificate cannot be read.
 * This returned pointer is the responsibility of the caller; if the memory is allocated the caller must free it.
 */
static uint8_t * prvPAL_ReadAndAssumeCertificate( const uint8_t * const pucCertName,
                                                  uint32_t * const ulSignerCertSize );

/* Location of the update slot in Flash. */
SFU_FwImageFlashTypeDef fw_image_dwl_area;

/* State of the downloaded OTA image
 * The state of the currently running image is stored in flash with the firmware image and is
 * accessed via SE_APP_GetActiveFwState() and SE_APP_SetActiveFwState(). The state of the OTA image
 * being downloaded is stored in RAM in OTAImageState. Depending on the state of the currently running
 * image we get/set one of the two image states.
 */
iot_state_t OTAImageState;

static const char pcTestCodeSigningCertificatePem[] = /* ecdsa-sha256-signer.crt.pem */
    "-----BEGIN CERTIFICATE-----\n"
    "MIIBXDCCAQOgAwIBAgIJAPMhJT8l0C6AMAoGCCqGSM49BAMCMCExHzAdBgNVBAMM\n"
    "FnRlc3Rfc2lnbmVyQGFtYXpvbi5jb20wHhcNMTgwNjI3MjAwNDQyWhcNMTkwNjI3\n"
    "MjAwNDQyWjAhMR8wHQYDVQQDDBZ0ZXN0X3NpZ25lckBhbWF6b24uY29tMFkwEwYH\n"
    "KoZIzj0CAQYIKoZIzj0DAQcDQgAEyza/tGLVbVxhL41iYtC8D6tGEvAHu498gNtq\n"
    "DtPsKaoR3t5xQx+6zdWiCi32fgFT2vkeVAmX3pf/Gl8nIP48ZqMkMCIwCwYDVR0P\n"
    "BAQDAgeAMBMGA1UdJQQMMAoGCCsGAQUFBwMDMAoGCCqGSM49BAMCA0cAMEQCIDkf\n"
    "83Oq8sOXhSyJCWAN63gc4vp9//RFCXh/hUXPYcTWAiBgmQ5JV2MZH01Upi2lMflN\n"
    "YLbC+lYscwcSlB2tECUbJA==\n"
    "-----END CERTIFICATE-----\n";

