jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/Cloud/aws_tests/Src/ports/aws_ota_pal.c
#ifndef ENABLE_IMAGE_STATE_HANDLING
iot_state_t liot_state __attribute__( ( section( "UNINIT_FIXED_LOC" ) ) );

static int setIoTDeviceState(iot_state_t *state)
{
	DEFINE_OTA_METHOD_NAME( "setIoTState" );
	int ret = 0;
	state->magic = USER_CONF_MAGIC;

	if (FLASH_update((uint32_t)&liot_state, state, sizeof(iot_state_t)) != 0)
	{
		OTA_LOG_L1( "[%s] ERROR - Failed programming the IOT state into Flash.\r\n", OTA_METHOD_NAME );
		ret = -1;
	}

	return ret;
}

static int getIoTDeviceState(const iot_state_t **state)
{
	int ret = -1;

	if (state != NULL)
	{
		if (liot_state.magic == USER_CONF_MAGIC)
		{
			*state = &liot_state;
			ret = 0;
		}
		else
		{
			*state = NULL;
		}
	}

	return ret;
}
#endif


static inline BaseType_t prvContextValidate( OTA_FileContext_t * C )
{
    return( ( C != NULL ) &&
            ( C->pucFile != NULL ) ); /*lint !e9034 Comparison is correct for file pointer type. */
}

/* Used to set the high bit of Windows error codes for a negative return value. */
#define OTA_PAL_INT16_NEGATIVE_MASK    ( 1 << 15 )

/* Size of buffer used in file operations on this platform (Windows). */
#define OTA_PAL_WIN_BUF_SIZE ( ( size_t ) 4096UL )

/* Attempt to create a new receive file for the file chunks as they come in. */

OTA_Err_t prvPAL_CreateFileForRx( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CreateFileForRx" );

    OTA_Err_t eResult = kOTA_Err_RxFileCreateFailed;

    if( C != NULL )
    {
#ifdef ENABLE_IMAGE_STATE_HANDLING
        /* Initialize OTA image state */
        if(kOTA_Err_None != prvInitOTAImageState())
        {
            OTA_LOG_L1( "[%s] ERROR - Unable to initialize OTA image state.\r\n", OTA_METHOD_NAME );
            return kOTA_Err_Panic;
        }
#else
        iot_state_t state = {
            .magic = 0,
            .ota_agent_state = eOTA_ImageState_Unknown
        };
#endif /* ENABLE_IMAGE_STATE_HANDLING */
        SFU_APP_GetDownloadAreaInfo(&fw_image_dwl_area);

#ifndef ENABLE_IMAGE_STATE_HANDLING
        if ( 0 != setIoTDeviceState(&state) )
        {
            OTA_LOG_L1( "[%s] ERROR - Unable to write to image state file.\r\n", OTA_METHOD_NAME );
        }
        else
#endif /* ENABLE_IMAGE_STATE_HANDLING */
        {
            C->pucFile = (void*) &fw_image_dwl_area; // Aliased to C->iFileHandle by union
            FLASH_Erase_Size(fw_image_dwl_area.DownloadAddr, fw_image_dwl_area.MaxSizeInBytes);
            OTA_LOG_L1( "[%s] Receive file created at 0x%08x.\r\n", OTA_METHOD_NAME, C->pucFile );
            eResult = kOTA_Err_None;
        }
    }
    else
    {
        OTA_LOG_L1( "[%s] ERROR - Invalid context provided.\r\n", OTA_METHOD_NAME );
    }

    return eResult; /*lint !e480 !e481 Exiting function without calling fclose.
                     * Context file handle state is managed by this API. */
}


/* Abort receiving the specified OTA update by closing the file. */

OTA_Err_t prvPAL_Abort( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_Abort" );

    /* Set default return status to uninitialized. */
    OTA_Err_t eResult = kOTA_Err_Uninitialized;
    int32_t lFileCloseResult = 0;

    if( NULL != C )
    {
        /* Close the OTA update file if it's open. */
        if( NULL != C->pucFile )
        {
            C->pucFile = NULL;

            if( 0 == lFileCloseResult )
            {
                OTA_LOG_L1( "[%s] OK\r\n", OTA_METHOD_NAME );
                eResult = kOTA_Err_None;
            }
            else /* Failed to close file. */
            {
                OTA_LOG_L1( "[%s] ERROR - Closing file failed.\r\n", OTA_METHOD_NAME );
                eResult = kOTA_Err_FileAbort;
            }
        }
        else
        {
            /* Nothing to do. No open file associated with this context. */
            eResult = kOTA_Err_None;
        }
    }
    else /* Context was not valid. */
    {
        OTA_LOG_L1( "[%s] ERROR - Invalid context.\r\n", OTA_METHOD_NAME );
        eResult = kOTA_Err_FileAbort;
    }

    return eResult;
}

/* Write a block of data to the specified file. */
int16_t prvPAL_WriteBlock( OTA_FileContext_t * const C,
                           uint32_t ulOffset,
                           uint8_t * const pacData,
                           uint32_t ulBlockSize )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_WriteBlock" );

    int16_t rc = 0;

    if( prvContextValidate( C ) == pdTRUE )
    {
        SFU_FwImageFlashTypeDef * fwImage = ( SFU_FwImageFlashTypeDef * ) C->pucFile;
        vLoggingPrintf("W: Received offset=%08x size=%d\n", ulOffset, ulBlockSize);

        /* Guard against slot overflow */
        if( ulOffset + ulBlockSize > fwImage->MaxSizeInBytes)
        {
            OTA_LOG_L1( "[%s] ERROR - Flash slot overflow.\r\n", OTA_METHOD_NAME );
            rc |= OTA_PAL_INT16_NEGATIVE_MASK;
        }
        else
        {
            int ret;
            uint8_t *pucBuf = ( uint8_t * ) fwImage->DownloadAddr;

            if( ( (( uint32_t )( pucBuf + ulOffset ) % 8) != 0 ) || ( ( ulBlockSize % 8 ) != 0) )
            {
                /* STM32L4 constraint: The destination memory is not aligned on double-word boundaries. */
                ret = FLASH_update(( uint32_t ) pucBuf + ulOffset, ( uint32_t * ) pacData, ulBlockSize);
            }
            else
            {
                ret = FLASH_Write( ( uint32_t ) pucBuf + ulOffset, ( uint32_t * ) pacData, ulBlockSize);
            }

            if( ret == 0 )
            {
                rc = ulBlockSize;
            }
            else
            {
                OTA_LOG_L1( "[%s] ERROR - fwrite failed\r\n", OTA_METHOD_NAME );
                rc |= OTA_PAL_INT16_NEGATIVE_MASK;
            }
        }
    }
    else /* Invalid context or file pointer provided. */
    {
        OTA_LOG_L1( "[%s] ERROR - Invalid context.\r\n", OTA_METHOD_NAME );
        rc |= OTA_PAL_INT16_NEGATIVE_MASK;
    }

    return ( int16_t ) rc;
}

/* Close the specified file. This shall authenticate the file if it is marked as secure. */

OTA_Err_t prvPAL_CloseFile( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CloseFile" );

    OTA_Err_t eResult = kOTA_Err_None;

    if( prvContextValidate( C ) == pdTRUE )
    {
        if( C->pxSignature != NULL )
        {
            /* Verify the file signature, close the file and return the signature verification result. */
            eResult = prvPAL_CheckFileSignature( C );
        }
        else
        {
            OTA_LOG_L1( "[%s] ERROR - NULL OTA Signature structure.\r\n", OTA_METHOD_NAME );
            eResult = kOTA_Err_SignatureCheckFailed;
        }

        /* Close the file. */
        C->pucFile = NULL;

        if( eResult == kOTA_Err_None )
        {
            OTA_LOG_L1( "[%s] %s signature verification passed.\r\n", OTA_METHOD_NAME, cOTA_JSON_FileSignatureKey );
        }
        else
        {
            OTA_LOG_L1( "[%s] ERROR - Failed to pass %s signature verification: %d.\r\n", OTA_METHOD_NAME,
                        cOTA_JSON_FileSignatureKey, eResult );

