jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/Cloud/aws_tests/Src/ports/aws_ota_pal.c
            /* If we fail to verify the file signature that means the image is not valid. We need to set the image state to aborted. */
            prvPAL_SetPlatformImageState( eOTA_ImageState_Aborted );
        }
    }
    else /* Invalid OTA Context. */
    {
        /* FIXME: Invalid error code for a null file context and file handle. */
        OTA_LOG_L1( "[%s] ERROR - Invalid context.\r\n", OTA_METHOD_NAME );
        eResult = kOTA_Err_FileClose;
    }

    return eResult;
}


/* Verify the signature of the specified file. */

static OTA_Err_t prvPAL_CheckFileSignature( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CheckFileSignature" );

    OTA_Err_t eResult = kOTA_Err_None;
    uint32_t ulBytesRead;
    uint32_t ulSignerCertSize;
    uint8_t * pucBuf, * pucSignerCert;
    void * pvSigVerifyContext;

    if( prvContextValidate( C ) == pdTRUE )
    {
        /* Verify the signature. */
        if( pdFALSE == CRYPTO_SignatureVerificationStart( &pvSigVerifyContext, cryptoASYMMETRIC_ALGORITHM_ECDSA, cryptoHASH_ALGORITHM_SHA256 ) )
        {
            eResult = kOTA_Err_SignatureCheckFailed;
        }
        else
        {
            OTA_LOG_L1( "[%s] Started %s signature verification, file: %s\r\n", OTA_METHOD_NAME,
                        cOTA_JSON_FileSignatureKey, ( const char * ) C->pucCertFilepath );
            pucSignerCert = prvPAL_ReadAndAssumeCertificate( ( const uint8_t * const ) C->pucCertFilepath, &ulSignerCertSize );

            if( pucSignerCert != NULL )
            {
                SFU_FwImageFlashTypeDef * fwImage = ( SFU_FwImageFlashTypeDef * ) C->pucFile;
                pucBuf = ( uint8_t * ) fwImage->DownloadAddr;
                ulBytesRead = C->ulFileSize;
                /* Include the file chunk in the signature validation. Zero size is OK. */
                CRYPTO_SignatureVerificationUpdate( pvSigVerifyContext, pucBuf, ulBytesRead );

                if( pdFALSE == CRYPTO_SignatureVerificationFinal( pvSigVerifyContext,
                    ( char * ) pucSignerCert,
                    ( size_t ) ulSignerCertSize,
                    C->pxSignature->ucData,
                    C->pxSignature->usSize ) ) /*lint !e732 !e9034 Allow comparison in this context. */
                {
                  eResult = kOTA_Err_SignatureCheckFailed;
                }
                pvSigVerifyContext = NULL;  /* The context has been freed by CRYPTO_SignatureVerificationFinal(). */
            }
            else
            {
                eResult = kOTA_Err_BadSignerCert;
            }
        }
    }
    else
    {
        /* FIXME: Invalid error code for a NULL file context. */
        OTA_LOG_L1( "[%s] ERROR - Invalid OTA file context.\r\n", OTA_METHOD_NAME );
        /* Invalid OTA context or file pointer. */
        eResult = kOTA_Err_NullFilePtr;
    }

    return eResult;
}


/* Read the specified signer certificate from the filesystem into a local buffer. The allocated
 * memory becomes the property of the caller who is responsible for freeing it.
 */

static uint8_t * prvPAL_ReadAndAssumeCertificate( const uint8_t * const pucCertName,
                                                  uint32_t * const ulSignerCertSize )
{
    //DEFINE_OTA_METHOD_NAME( "prvPAL_ReadAndAssumeCertificate" );

    /* The crypto code requires the terminating zero to be part of the length so add 1. */
    if (0 == strcmp("ecdsa-sha256-signer.crt.pem", (const char *) pucCertName))
    {
        *ulSignerCertSize = strlen(pcTestCodeSigningCertificatePem) + 1;
        return (uint8_t*) pcTestCodeSigningCertificatePem;
    }
    else
    {
        *ulSignerCertSize = 0;
        return NULL;
    }
}


OTA_Err_t prvPAL_ResetDevice( void )
{
    NVIC_SystemReset();
    /* return kOTA_Err_None; with IAR, returning after NVIC_SystemReset() produces a cc warning*/
}


OTA_Err_t prvPAL_ActivateNewImage( void )
{
    uint32_t  fw_header_input[(SE_FW_HEADER_TOT_LEN + 3) / 4];
    /* Read header in slot 1 */
    memcpy((void *) fw_header_input, (void *) fw_image_dwl_area.DownloadAddr, sizeof(fw_header_input));

  /* Ask for installation at next reset */
  (void) SFU_APP_InstallAtNextReset(fw_header_input);

  return prvPAL_ResetDevice();
}


/*
 * Set the final state of the last transferred (final) OTA file (or bundle).
 * On Windows, the state of the OTA image is stored in PlaformImageState.txt.
 */

#ifndef ENABLE_IMAGE_STATE_HANDLING
OTA_Err_t prvPAL_SetPlatformImageState( OTA_ImageState_t eState )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_SetPlatformImageState" );

    OTA_Err_t eResult = kOTA_Err_None;

    if( eState != eOTA_ImageState_Unknown && eState <= eOTA_LastImageState )
    {
        iot_state_t newState;
        const iot_state_t *pCurState = NULL;
        getIoTDeviceState(&pCurState);

        if( eState == eOTA_ImageState_Accepted )
        {
            if( pCurState->ota_agent_state != eOTA_ImageState_Testing )
            {
                eResult = kOTA_Err_CommitFailed;
            }
            else
            {
                newState.ota_agent_state = eState;
            }
        }
        else if( eState == eOTA_ImageState_Testing )
        {
            if( pCurState->ota_agent_state != eOTA_ImageState_Unknown )
            {
                eResult = kOTA_Err_CommitFailed;
            }
            else
            {
                newState.ota_agent_state = eState;
            }
        }
        else if( eState == eOTA_ImageState_Rejected )
        {
            newState.ota_agent_state = eState; // else kOTA_Err_RejectFailed
        }
        else if( eState == eOTA_ImageState_Aborted )
        {
            newState.ota_agent_state = eState;  // else kOTA_Err_AbortFailed
        }
        else
        {
            eResult = kOTA_Err_BadImageState;
        }

        if ( ( eResult == kOTA_Err_None ) && ( setIoTDeviceState(&newState) != 0) )
        {
            OTA_LOG_L1( "[%s] ERROR - Unable to write to image state file.\r\n", OTA_METHOD_NAME );
            eResult = kOTA_Err_Panic;
        }
    }
    else /* Image state invalid. */
    {
        OTA_LOG_L1( "[%s] ERROR - Invalid image state provided.\r\n", OTA_METHOD_NAME );
        eResult = kOTA_Err_BadImageState;
    }

    return eResult;
}

#else

OTA_Err_t prvInitOTAImageState(void)
{
      OTAImageState.magic = 0;
      OTAImageState.ota_agent_state = eOTA_ImageState_Unknown;
      return kOTA_Err_None;
}

OTA_Err_t prvSetOTAImageState( OTA_ImageState_t eNewOTAState )
{
  OTA_Err_t result = kOTA_Err_BadImageState;
  /* Can't set image state to unknown or out of range */
  if((eNewOTAState<=0)||(eNewOTAState>eOTA_LastImageState))
  {
    result = kOTA_Err_BadImageState;
  }
  else
  {
    switch(eNewOTAState)
    {
      case eOTA_ImageState_Accepted:
        /* can only set Accepted if the image is running (in self test mode) */
        result = kOTA_Err_CommitFailed;
        break;
      default:
        OTAImageState.ota_agent_state = eNewOTAState;
        result = kOTA_Err_None;
    }
  }
  return result;
}



OTA_Err_t prvPAL_SetPlatformImageState( OTA_ImageState_t eState )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_SetPlatformImageState" );
    SE_FwStateTypeDef eCurrentImageState = FWIMG_STATE_UNKNOWN;
    OTA_Err_t eResult = kOTA_Err_Uninitialized;

    SE_ErrorStatus e_se_estatus = SE_ERROR;
    SE_StatusTypeDef eSE_Status = SE_OK;

    /* Read the state of the currently running image */
    e_se_estatus = SE_APP_GetActiveFwState(&eSE_Status, &eCurrentImageState);
    if(SE_SUCCESS != e_se_estatus)
    {
      /* Error getting image state */
      return kOTA_Err_BadImageState;
    }

    OTA_LOG_L1( "[%s] Current state (SE_FwStateTypeDef) %d\r\n", OTA_METHOD_NAME, eCurrentImageState );
    OTA_LOG_L1( "[%s] Request to change state to (OTA_ImageState_t) %d\r\n", OTA_METHOD_NAME, eState );

    /* if the current image is in SELFTEST mode we can update its state, otherwise
     * we act on the state of the OTA image being received
     */
    if( FWIMG_STATE_SELFTEST == eCurrentImageState)
    {
      /* This is an image launched in self test mode! - we can update either to valid or invalid */
      switch(eState)
      {
        /* the image was accepted after self tests succeeded */
        case eOTA_ImageState_Accepted:
        {
          SE_FwStateTypeDef eNewImageState = FWIMG_STATE_VALID;
          e_se_estatus = SE_APP_SetActiveFwState(&eSE_Status, &eNewImageState);
          if(SE_SUCCESS == e_se_estatus)
          {
            /* Commit was successful */
            eResult = kOTA_Err_None;
            eCurrentImageState = eNewImageState;
            OTA_LOG_L1( "[%s] New current state (SE_FwStateTypeDef) %d\r\n", OTA_METHOD_NAME, eCurrentImageState );
            /* Erase backup image as it is no longer needed */
            SFU_APP_GetDownloadAreaInfo(&fw_image_dwl_area);
            FLASH_Erase_Size(fw_image_dwl_area.DownloadAddr, fw_image_dwl_area.MaxSizeInBytes);
          }
          else
          {
            /* Image is valid but commit failed */
            eResult = kOTA_Err_CommitFailed;
          }
          break;
        }
        /* the image is already in testing state */
        case eOTA_ImageState_Testing:
        {
          eResult = kOTA_Err_None;
          break;
        }
        /* Image was rejected - set as INVALID */
        case eOTA_ImageState_Rejected:
        /* all other image states will set to invalid */
        default:
        {
          SE_FwStateTypeDef eNewImageState = FWIMG_STATE_INVALID;
          e_se_estatus = SE_APP_SetActiveFwState(&eSE_Status, &eNewImageState);
          if(SE_SUCCESS == e_se_estatus)
          {
            eResult = kOTA_Err_None;
            eCurrentImageState = eNewImageState;
            OTA_LOG_L1( "[%s] New current state (SE_FwStateTypeDef) %d\r\n", OTA_METHOD_NAME, eCurrentImageState );
          }
          else
          {
            eResult = kOTA_Err_RejectFailed;
          }
          break;
        }
      }
    }
    else
    {
      /* Image is not in self-test mode - we update the OTA image state */
      eResult = prvSetOTAImageState( eState );
    }
    return eResult;
}

#endif /* ENABLE_IMAGE_STATE_HANDLING */

