jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/Cloud/aws_tests/Src/ports/aws_ota_pal.c
#ifndef ENABLE_IMAGE_STATE_HANDLING
/* Get the state of the currently running image.
 *
 * We read this at OTA_Init time so we can tell if the MCU image is in self
 * test mode. If it is, we expect a successful connection to the OTA services
 * within a reasonable amount of time. If we don't satisfy that requirement,
 * we assume there is something wrong with the firmware and reset the device,
 * causing it to rollback to the previous code.
 */
OTA_PAL_ImageState_t prvPAL_GetPlatformImageState( void )
{
    //DEFINE_OTA_METHOD_NAME( "prvPAL_GetPlatformImageState" );

    OTA_PAL_ImageState_t ePalState = eOTA_PAL_ImageState_Unknown;
    iot_state_t const * pState = NULL;

    if (getIoTDeviceState(&pState) == 0)
    {
        switch (pState->ota_agent_state)
			  {
				    case eOTA_ImageState_Testing:
					      ePalState = eOTA_PAL_ImageState_PendingCommit;
					      break;
				    case eOTA_ImageState_Accepted:
					      ePalState = eOTA_PAL_ImageState_Valid;
					      break;
				    case eOTA_ImageState_Rejected:
				    case eOTA_ImageState_Aborted:
				    default:
					      ePalState = eOTA_PAL_ImageState_Invalid;
					      break;
			  }
		}
    else
    {
        /* If no image state exists, assume a factory image. */
		    ePalState = eOTA_PAL_ImageState_Valid;
    }

    return ePalState; /*lint !e64 !e480 !e481 I/O calls and return type are used per design. */
}
#else

/* Read the state of the OTA image */
OTA_ImageState_t prvGetOTAImageState( void )
{
    return (OTA_ImageState_t) OTAImageState.ota_agent_state;
}

/* Get the state of the currently running image.
 *
 * We read this at OTA_Init time so we can tell if the MCU image is in self
 * test mode. If it is, we expect a successful connection to the OTA services
 * within a reasonable amount of time. If we don't satisfy that requirement,
 * we assume there is something wrong with the firmware and reset the device,
 * causing it to rollback to the previous code.
 */
OTA_PAL_ImageState_t prvPAL_GetPlatformImageState( void )
{
  DEFINE_OTA_METHOD_NAME( "prvPAL_GetPlatformImageState" );

  OTA_PAL_ImageState_t ePalState = eOTA_PAL_ImageState_Unknown;
  OTA_ImageState_t eOTAImageState = eOTA_ImageState_Unknown;
  SE_FwStateTypeDef eCurrentImageState = FWIMG_STATE_UNKNOWN;

  SE_ErrorStatus e_se_estatus = SE_ERROR;
  SE_StatusTypeDef eSE_Status = SE_OK;

  /* Get state of running image */
  e_se_estatus = SE_APP_GetActiveFwState(&eSE_Status, &eCurrentImageState);
  /* Get state of OTA image */
  eOTAImageState = prvGetOTAImageState();
  /* If the CurrentImageState is SELFTEST, we return it, otherwise we return the OTA image state */
  if(SE_SUCCESS == e_se_estatus)
  {
    if(eCurrentImageState == FWIMG_STATE_SELFTEST)
    {
      ePalState = eOTA_PAL_ImageState_PendingCommit;
    }
    else
    {
      switch(eOTAImageState)
      {
        case eOTA_ImageState_Unknown:
          ePalState = eOTA_PAL_ImageState_Unknown;
          break;
        case eOTA_ImageState_Testing:
          ePalState = eOTA_PAL_ImageState_PendingCommit;
          break;
        case eOTA_ImageState_Accepted:
          ePalState = eOTA_PAL_ImageState_Valid;
          break;
        case eOTA_ImageState_Rejected:
          ePalState = eOTA_PAL_ImageState_Invalid;
          break;
        case eOTA_ImageState_Aborted:
          ePalState = eOTA_PAL_ImageState_Invalid;
          break;
        default:
          ePalState = eOTA_PAL_ImageState_Unknown;
      }
    }
  }
  OTA_LOG_L3( "[%s] Got state from Current Image (SE_FwStateTypeDef) %d\r\n", OTA_METHOD_NAME, eCurrentImageState );
  OTA_LOG_L3( "[%s] Got state from OTA Image (OTA_PAL_ImageState_t) %d\r\n", OTA_METHOD_NAME, eOTAImageState );
  OTA_LOG_L3( "[%s] Returning state (OTA_PAL_ImageState_t) %d\r\n", OTA_METHOD_NAME, ePalState );
  return ePalState;
}
#endif /* ENABLE_IMAGE_STATE_HANDLING */


static uint32_t SFU_APP_GetDownloadAreaInfo(SFU_FwImageFlashTypeDef *pArea)
{
  uint32_t ret = 0;

  if (pArea != NULL)
  {
    pArea->DownloadAddr = SFU_IMG_SLOT_DWL_REGION_BEGIN_VALUE;
    pArea->MaxSizeInBytes = (uint32_t)SFU_IMG_SLOT_DWL_REGION_SIZE;
    pArea->ImageOffsetInBytes = SFU_IMG_IMAGE_OFFSET;
  }
  else
  {
    ret = -1;
  }

  return ret;
}

static uint32_t SFU_APP_InstallAtNextReset(uint32_t *fw_header)
{
	uint32_t ret = HAL_OK;
	uint8_t zero_buffer[SFU_IMG_IMAGE_OFFSET - SE_FW_HEADER_TOT_LEN];

	if (fw_header == NULL)
	{
		return -1;
	}

	memset(zero_buffer, 0, SFU_IMG_IMAGE_OFFSET - SE_FW_HEADER_TOT_LEN);
    ret = FLASH_Erase_Size((uint32_t) SFU_IMG_SWAP_REGION_BEGIN_VALUE, SFU_IMG_IMAGE_OFFSET);
    if (ret == HAL_OK)
    {
      ret = FLASH_Write((uint32_t)SFU_IMG_SWAP_REGION_BEGIN_VALUE, fw_header, SE_FW_HEADER_TOT_LEN);
    }
    if (ret == HAL_OK)
    {
      ret = FLASH_Write((uint32_t )(SFU_IMG_SWAP_REGION_BEGIN_VALUE + SE_FW_HEADER_TOT_LEN), (void *)zero_buffer, SFU_IMG_IMAGE_OFFSET - SE_FW_HEADER_TOT_LEN);
    }

    return (ret == HAL_OK) ? 0 : -1;
}

/* Provide access to private members for testing. */
#include "aws_ota_pal_test_access_define.h"
